backend/controllers/AdminController.php

SELECT COUNT(*) FROM `shop_admin`
SELECT * FROM `shop_admin` LIMIT 10
---
    public function actionIndex(){
        $keywords=\Yii::$app->request->get('keywords');
        if($keywords) {
            $where = ['like', 'username', $keywords];
        }else{
            $where='';
        }

        $admin=Admin::find()->where($where);
        $pages= new Pagination([
            'pageSize'=>10,
            'totalCount'=>$admin->count()
        ]);
        $list=$admin
            ->offset($pages->offset)
            ->limit($pages->limit)
            ->asArray()
            ->all();