backend/controllers/BrandController.php

    public function actionOperate(){
        if(\Yii::$app->request->isAjax){
            $id=\Yii::$app->request->post('id');
            $info=Brand::findOne($id);
            $info->active=($info['active']==0)?1:0;
            if($info->save()){
---
SELECT * FROM `shop_brand` WHERE `id`='1'
UPDATE `shop_brand` SET `active`=0 WHERE `id`='1'

            }
        }else{
            $id=\Yii::$app->request->get('id');
            $info=Brand::findOne($id);
---
SELECT * FROM `shop_brand` WHERE `id`='1'