backend/controllers/GoodsController.php

    public function actionIndex(){
        $keywords=trim(\Yii::$app->request->get('keywords'));
        if($keywords){
            $where=['like','goodsname',$keywords];
        }else{
            $where='';
        }
        $condition['delete']=0;
        $goods=Goods::find()->where($where)->andWhere($condition);
        $pages= new Pagination([
            'pageSize'=>10,
            'totalCount'=>$goods->count()
        ]);
        $list=$goods->joinWith('cate')
            ->joinWith('brand')
            ->offset($pages->offset)
            ->limit($pages->limit)
            ->asArray()->all();
---
SELECT COUNT(*) FROM `shop_goods`
SELECT `shop_goods`.* FROM `shop_goods` LEFT JOIN `shop_category` ON `shop_goods`.`cid` = `shop_category`.`id` LEFT JOIN `shop_brand` ON `shop_goods`.`bid` = `shop_brand`.`id` LIMIT 10

    public function actionEdit(){
        if(\Yii::$app->request->isPost){

        }else{
            $id=\Yii::$app->request->get('id');
            $info=Goods::find()->alias('g')
                ->where(['g.id'=>$id])
                ->joinWith('cate')
                ->joinWith('brand')
                ->joinWith('pics')
                ->asArray()
                ->one();
            //print_r($info);die;
            $list=Category::find()->orderBy('path')->asArray()->all();
            foreach($list as $val){
                $space=count(explode(',',$val['path']));
                $val['catename']=str_repeat("&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;",$space).$val['catename'];
                $category[]=$val;
            }
            $brand=Brand::find()->asArray()->all();
---
SELECT `g`.* FROM `shop_goods` `g` LEFT JOIN `shop_category` ON `g`.`cid` = `shop_category`.`id` LEFT JOIN `shop_brand` ON `g`.`bid` = `shop_brand`.`id` WHERE `g`.`id`='1'
SELECT * FROM `shop_category` ORDER BY `path`
SELECT * FROM `shop_brand`

    public function actionOperate(){
        if(\Yii::$app->request->isAjax){
            $id=\Yii::$app->request->post('id');
            $info=Goods::findOne($id);
            $info->display=$info['display']==0?1:0;
            if($info->save()){
---
SELECT * FROM `shop_goods` WHERE `id`='1'
UPDATE `shop_goods` SET `display`=1 WHERE `id`='1'