backend/controllers/IndexController.php

    public function init(){
        parent::init();
        $aid=\Yii::$app->session->get('aid');
        $this->info=Admin::findOne($aid);
---
SELECT * FROM `shop_admin` WHERE `id`='1'

    public function actionLeft(){
        $list=AdminNav::find()->where(['pid'=>0])->orderBy('priority')->all();
---
SELECT * FROM `shop_admin_nav` WHERE `pid`=0 ORDER BY `priority`

    public function actionMain(){
        $goods=Goods::find()->orderBy('salenum desc')->limit(10)->asArray()->all();
        $member=Member::find();
        $count['num1']=$member->where(['level'=>1])->count();
        $count['num2']=$member->where(['level'=>2])->count();
        $count['num3']=$member->where(['level'=>3])->count();
        $count['num4']=$member->where(['level'=>4])->count();
        $count['num5']=$member->where(['level'=>5])->count();
---
SELECT * FROM `shop_goods` ORDER BY `salenum` DESC LIMIT 10
SELECT COUNT(*) FROM `shop_member` WHERE `level`=1
SELECT COUNT(*) FROM `shop_member` WHERE `level`=2
SELECT COUNT(*) FROM `shop_member` WHERE `level`=3
SELECT COUNT(*) FROM `shop_member` WHERE `level`=4
SELECT COUNT(*) FROM `shop_member` WHERE `level`=5