backend/controllers/IntegralController.php

INSERT INTO `shop_integral` (`goodsname`, `integral`, `num`, `detail`, `addtime`) VALUES ('358', '358', '358', '358', '1498292637')
---
    public function addlist(){
        if(IS_POST){
            $goods=D('Integral');
            $data=$goods->create();