backend/controllers/MemberController.php

SELECT COUNT(*) FROM `shop_member`
SELECT `shop_member`.*, `shop_level`.`level_name` FROM `shop_member` LEFT JOIN `shop_level` ON `shop_member`.`level` = `shop_level`.`id` ORDER BY `addtime` LIMIT 10
---
    public function actionIndex(){
        $keywords=trim(\Yii::$app->request->get('keywords'));
        if($keywords){
            $where=['like','username',$keywords];
        }else{
            $where='';
        }
        $member=Member::find()->where($where);
        $pages= new Pagination([
            'pageSize'=>10,
            'totalCount'=>$member->count(),
        ]);
        /*$list=$member->order("addtime")->join('shop_level ON shop_member.level=shop_level.lid')
            ->where($condition)
            ->limit($page->firstRow.",".$page->listRows)
            ->select();*/
        $list=$member->joinWith('level')
            ->offset($pages->offset)
            ->limit($pages->limit)
            ->orderBy('addtime')
            ->all();