backend/controllers/OrderController.php

    public function actionIndex(){
        $status=\Yii::$app->request->get('status');
        $keywords=trim(\Yii::$app->request->get('keywords'));
        $username=trim(\Yii::$app->request->get('username'));
        if($status){
            $where=['{{%order}}.order_status'=>$status];
        }else{
            $where='';
        }
        if($keywords){
            $condition=['like','{{%order}}.order_syn or {{%order}}.order_price',$keywords];
        }else{
            $condition='';
        }
        if($username){
            $factor=['like','{{%member}}.username',$username];
        }else{
            $factor='';
        }
        $order=Order::find()->joinWith('member')->where($where)->where($condition)->andWhere($factor);
        $pages= new Pagination([
            'pageSize'=>10,
            'totalCount'=>$order->count()
        ]);
        $list=$order->joinWith('status')
            ->select('{{%order}}.*,{{%member}}.username,{{%order_status}}.status_name')
            ->offset($pages->offset)
            ->limit($pages->limit)
            ->orderBy('{{%order}}.id desc')
            ->asArray()
            ->all();
---
SELECT COUNT(*) FROM `shop_order` LEFT JOIN `shop_member` ON `shop_order`.`mid` = `shop_member`.`id`
SELECT `shop_order`.*, `shop_member`.`username`, `shop_order_status`.`status_name` FROM `shop_order` LEFT JOIN `shop_order_status` ON `shop_order`.`order_status` = `shop_order_status`.`id` LEFT JOIN `shop_member` ON `shop_order`.`mid` = `shop_member`.`id` WHERE `shop_member`.`username` LIKE '%栗飞%' ORDER BY `shop_order`.`id` DESC LIMIT 10 OFFSET 10

    public function showlist(){
        //实例化管理员表数据模型
        $order=D("Order");
        //代表有没有传递状态值
        $status=I("get.status")?I("get.status"):'';
        //搜索条件传递给前台模板
        $order_syn=I("get.order_syn");
        $order_status=I("get.order_status");
        $username=I("get.username");
        //订单号或者价格搜索条件
        $search["order_syn|order_price"]=array("like","%".I('get.order_syn')."%");
        //订单状态搜索条件
        $search["order_status"]=array("like","%".I('get.order_status')."%");
        //根据用户名，查找该用户在订单表中所对应的【mid】作为搜索条件
        $usersearch["username"]=array("like","%".I('get.username')."%");
        $user=M("Member");
        $userinfo=$user->where($usersearch)->find();
---
SELECT * FROM `shop_member` WHERE `id` IN ('47', '12', '4')