backend/controllers/SaleController.php

SELECT COUNT(*) FROM `shop_vote`
SELECT `v`.*, `g`.`goodsname`, `g`.`pic` FROM `shop_vote` `v` LEFT JOIN `shop_activity` `a` ON `v`.`aid` = `a`.`id` INNER JOIN `shop_goods` `g` ON a.gid=g.id ORDER BY `votetime` DESC LIMIT 10
---
    public function actionRecord(){
        $vote=Vote::find();
        $pages= new Pagination([
            'pageSize'=>10,
            'totalCount'=>$vote->count()
        ]);
        $list=$vote->alias('v')
            ->joinWith('activity a')
            ->innerJoin('shop_goods g','a.gid=g.id')
            ->select('v.*,g.goodsname,g.pic')
            ->offset($pages->offset)
            ->limit($pages->limit)
            ->orderBy('votetime desc')
            ->asArray()->all();