frontend/controllers/BaseController.php

SELECT * FROM `shop_member` WHERE `id` IS NULL
---
    public function init(){
        parent::init();
        $mid=\Yii::$app->session->get('mid');
        $info=Member::findOne($mid);