frontend/controllers/IndexController.php

    public function actionIndex(){
        $mid=$this->mid;
        $info=Member::findOne($mid);
        $category=$this->getCategory();
        $recommend=Goods::find()->where(['display'=>1,'activity'=>0])->orderBy('salenum desc')->limit(8)->asArray()->all();
        $brand=Brand::find()->limit(10)->asArray()->all();
        $order=$this->getOrderList();
        $news=News::find()->where(['isshow'=>1])->limit(6)->orderBy('addtime desc')->asArray()->all();
        $hot=Goods::find()->where(['display'=>1,'activity'=>1])->orderBy('salenum desc')->limit(8)->asArray()->all();
        $activity=Activity::find()->joinWith('goods')->limit(5)->asArray()->all();
        $advertise=$this->getAdvertise();
        $list['a']=$this->getGoodsList(1);
        $list['b']=$this->getGoodsList(2);
        $list['c']=$this->getGoodsList(3);
        $list['d']=$this->getGoodsList(4);
        $like=Goods::find()->orderBy('clicknum desc')->limit(6)->asArray()->all();
        $article=$this->getArticle();
        if(is_int($mid) && $mid>0){
            $sum=Cart::find()->where(['mid'=>$mid])->sum('buynum');
---
SELECT * FROM `shop_member` WHERE `id`=47
SELECT * FROM `shop_goods` WHERE (`display`=1) AND (`activity`=0) ORDER BY `salenum` DESC LIMIT 8
SELECT * FROM `shop_brand` LIMIT 10
SELECT * FROM `shop_news` WHERE `isshow`=1 ORDER BY `addtime` DESC LIMIT 6
SELECT * FROM `shop_goods` WHERE (`display`=1) AND (`activity`=1) ORDER BY `salenum` DESC LIMIT 8
SELECT `shop_activity`.* FROM `shop_activity` LEFT JOIN `shop_goods` ON `shop_activity`.`gid` = `shop_goods`.`id` LIMIT 5
SELECT * FROM `shop_goods` ORDER BY `clicknum` DESC LIMIT 6
SELECT SUM(buynum) FROM `shop_cart` WHERE `mid`=47

    public function getCategory(){
        $where['pid']=0;
        $where['active']=1;
        $category=Category::find()->where($where)->asArray()->all();
---
SELECT * FROM `shop_category` WHERE `id`=1

    public function getGoodsList($id){
        $info=Category::findOne($id);
        $where=['like','path',$info['path']];
        $cate=Category::find()->where($where)->asArray()->all();
---
SELECT * FROM `shop_category` WHERE `id`=1
SELECT * FROM `shop_category` WHERE `path` LIKE '%1%'

    public function getArticle(){
        $article=Article::find()->where(['active'=>1])->select('title')->groupBy('title')->asArray()->all();
        foreach($article as $k=>$v){
            $article[$k]['category']=Article::find()->where(['title'=>$v['title']])->asArray()->all();
---
SELECT `title` FROM `shop_article` WHERE `active`=1 GROUP BY `title`
SELECT * FROM `shop_article` WHERE `title`='售后保障'