frontend/controllers/IndexController.php

    public function getGoodsList($id){
        $info=Category::findOne($id);
        $where=['like','path',$info['path']];
        $cate=Category::find()->where($where)->asArray()->all();
---
SELECT * FROM `shop_category` WHERE `path` LIKE '%1%'

    public function getArticle(){
        $article=Article::find()->where(['active'=>1])->select('title')->groupBy('title')->asArray()->all();
        foreach($article as $k=>$v){
            $article[$k]['category']=Article::find()->where(['title'=>$v['title']])->asArray()->all();
---
SELECT `title` FROM `shop_article` WHERE `active`=1 GROUP BY `title`
SELECT * FROM `shop_article` WHERE `title`='售后保障'