frontend/controllers/PayController.php

SELECT * FROM `shop_order` WHERE `id` IS NULL
---
    public function actionIndex(){
        if(\Yii::$app->request->isAjax){
            $oid=\Yii::$app->request->post('oid');
            $address=\Yii::$app->request->post('address');
            $delivery=\Yii::$app->request->post('delivery');
            if(!$address){
                return Json::encode(['code'=>5,'body'=>'收货地址不能为空']);
            }
            $info=Order::findOne($oid);
            $info->address=$address;
            $info->delivery=$delivery;
            if($info->save()){
                return Json::encode(['code'=>1,'body'=>'订单提交成功']);
            }else{
                return Json::encode(['code'=>5,'body'=>'订单提交失败']);
            }
        }else{
            $oid=\Yii::$app->request->get('oid');
            $info=Order::findOne($oid);