frontend/controllers/PersonalController.php

    public function actionAccount(){
        $mid=$this->mid;
        $info=Member::findOne($mid);
---
SELECT * FROM `shop_member` WHERE `id`=47