frontend/controllers/ProductController.php

SELECT * FROM `shop_brand` WHERE `active`=1
---
        }else{
            $order_by='num';
        }
        $brand=Brand::findAll(['active'=>1]);

SELECT * FROM `shop_goods` WHERE `display`=1 ORDER BY `salenum` DESC LIMIT 10
---
            'totalCount'=>$goods->count()
        ]);
        $goodsList=$goods->offset($pages->offset)->limit($pages->limit)->orderBy($order_by)->asArray()->all();
        $sales=Goods::find()->where(['display'=>1])->orderBy('salenum desc')->limit(10)->asArray()->all();