frontend/controllers/RomaController.php

    public function actionCreate()
    {
        $model = new Goods();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            $brand=Brand::find()->asArray()->all();
            if ($brand && is_array($brand)) {
                foreach ($brand as $k => $v) {
                    $list1[$v['id']] = $v['bname'];
                }
            }
            $category=Category::find()->orderBy('path')->asArray()->all();
---
SELECT * FROM `shop_brand`
SELECT * FROM `shop_category` ORDER BY `path`